app/views/users/show.html.erb

  <% if not @user.ratings.nil? %>
    Has <%= @user.ratings.count %> ratings. Average: <%= @user.average_rating %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]