app/views/breweries/show.html.erb

<p>
  <% if @brewery.ratings.empty? %>
---
SELECT 1 AS one FROM "ratings" INNER JOIN "beers" ON "ratings"."beer_id" = "beers"."id" WHERE "beers"."brewery_id" = ? LIMIT 1  [["brewery_id", 1]]