app/controllers/beer_clubs_controller.rb

  def index
    @beer_clubs = BeerClub.all
---
SELECT "beer_clubs".* FROM "beer_clubs"

    def set_beer_club
      @beer_club = BeerClub.find(params[:id])
---
SELECT "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", "1"]]