app/controllers/beers_controller.rb

  def set_breweries_and_styles_for_template
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 1], ["created_at", Sun, 26 Jan 2014 14:15:52 UTC +00:00], ["name", "Koff Porter"], ["style", "Porter"], ["updated_at", Sun, 26 Jan 2014 14:15:52 UTC +00:00]]