app/controllers/breweries_controller.rb

INSERT INTO "breweries" ("created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", Wed, 15 Jan 2014 00:15:10 UTC +00:00], ["name", "Sinebrychoff"], ["updated_at", Wed, 15 Jan 2014 00:15:10 UTC +00:00], ["year", 1819]]
---
  def create
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save