app/controllers/memberships_controller.rb

  def new
    @membership = Membership.new
    @beer_clubs = BeerClub.all
---
SELECT "beer_clubs".* FROM "beer_clubs"

  def create
    @membership = Membership.new(membership_params)
    respond_to do |format|
      if @membership.save
---
INSERT INTO "memberships" ("beer_club_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["created_at", Sun, 02 Feb 2014 21:18:12 UTC +00:00], ["updated_at", Sun, 02 Feb 2014 21:18:12 UTC +00:00], ["user_id", 1]]

    def set_membership
      @membership = Membership.find(params[:id])
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT 1  [["id", "1"]]