app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings" WHERE (13) LIMIT 1
DELETE FROM "ratings" WHERE "ratings"."id" = 1
---
  def destroy
    rating = Rating.find_by(params[:id])
    rating.delete if current_user == rating.user

INSERT INTO "ratings" ("beer_id", "created_at", "score", "updated_at") VALUES (?, ?, ?, ?)  [["beer_id", 1], ["created_at", Sun, 26 Jan 2014 10:46:01 UTC +00:00], ["score", 10], ["updated_at", Sun, 26 Jan 2014 10:46:01 UTC +00:00]]
SELECT "beers".* FROM "beers"
---
  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)
    if @rating.save
      current_user.ratings << @rating
      redirect_to user_path current_user
    else
      @beers = Beer.all