app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'tyhjis' LIMIT 1
---
    def create
      user = User.find_by username: params[:username]