app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Thu, 30 Jan 2014 14:10:28 UTC +00:00], ["updated_at", Thu, 30 Jan 2014 14:10:28 UTC +00:00], ["username", "tyhjis"]]

  def destroy
    if @user == current_user
      @user.ratings.each do |r|
        r.delete
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 7]]
DELETE FROM "ratings" WHERE "ratings"."id" = 35
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]